package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

import java.util.Calendar;
import java.util.Date;

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
        //Date data = new Date();
        //int d = data.getDate();
        //int m = data.getMonth();
        //int y = data.getYear();
        System.out.println("13 02 2015");
    }
}
