package com.javarush.test.level03.lesson06.task03;

/* Семь цветов радуги
Выведи на экран текст - семь цветов радуги.
В каждой строке должно быть по три цвета, в последней - один.
Цвета в строках разделяй пробелом.
Запомни: буквы Ё в тестах нигде нет.
Чтобы тесты проходили правильно, во всех задачах заменяй Ё на Е.
*/

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
        String text1 = "красный";
        String text2 = "оранжевый";
        String text3 = "желтый";
        String text4 = "зеленый";
        String text5 = "голубой";
        String text6 = "синий";
        String text7 = "фиолетовый";
        System.out.println(text1+" "+text2+" "+text3);
        System.out.println(text4+" "+text5+" "+text6);
        System.out.println(text7);
    }
}